[
  {
    "subject": "Open Me First",
    "messageSelect": [
      {
        "message": "Hello Sir",
        "img": "http://kpopchingu.com/wp-content/uploads/2020/06/0-1024x1024.jpg",
        "desc": "Wow you finally graduated!Do you feel accomplish? But welp surprise!(sort of even though you help me with this)BUT here is my final gift I am giving you at least until your birthday! I wanted to give you a gift that is special and what better gift to give you than a gift that is the main source of my pain and suffering into one. So below this message in the combo there are 3 options you have (Happy, Sad, Missing You) whenever you feel these emotions you can click on it and then the message will be automatically generated in the list box with random messages for you. I hope you enjoy I tried my best to give you the best! Congrats on surviving OU and good luck at OU Tulsa :P. FYI There may be more when I update in the future as I think of more content for you. But for now enjoy this little gift that I have for you."
      }
   
    ]
  },
  {
    "subject": "Happy",
    "messageSelect": [
      {
        "message": "☁",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/clouds.jpg?raw=true",
        "desc": "I had to include one of your favorite pictures of me. Some reason despite my messy hair in this one you find this one your favorite and haha got your head in the clouds. Someone seems to be in a cheery mood for you to see this picture hehe. Maybe by this time you have a new favorite, but wouldn't you say this is a nice throwback to good times? I hope you been well and all after working your big boy job (if you have already started) Thank you for moments like this picture for making me feel pretty every now and then."
      },
      {
        "message": "❤",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/day.jpg?raw=true",
        "desc": "Did I make your heart doki doki here? hehe maybe not you are always someone very hard to impress at times like this. But welp I hope I made you smile just a little bit today. I am still very surprise you end up falling for me. Just thought you would rather have someone else or just do your own thing at times. But hehe I also like you too in the end. I always enjoy our moments together and hopefully we get back to them very soon. Despite you possibly being two hours away. I hope by the time you read this that you enjoy our time together. Whether that may be cuddle or you just sitting on your desk listening to me type this code lol."
      },
      {
        "message": "💐",
        "img": "https://kpophighindia.com/wp-content/uploads/2021/03/ExE4exBU8AE_snB.jpg",
        "desc": "Hey look at this nice,cute,pretty picture of IU! I'm glad to somewhat see that you click on here because you are happy. Welp here is an IU picture to make your day even more brighter. Funny how this exact album got us a bit closer to each other as friends.Honestly, this is one of my favorite concepts she has. I would want to do one like this one day! So yeah IU, really is one of the reasons where we are today."
      }
    ]
  },
  {
    "subject": "Sad",
    "messageSelect": [
      {
        "message": "T^T its okay",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/IMG_4516.jpg?raw=true",
        "desc": "I'm sorry to hear that you have a bad day, but look at it this way there is will another day tomorrow for it to be the best day! Don't let this define you in anyway I just hope you take care of yourself after a hard days work. Of course, you know my number and I think almost every social media outlook I have now lol. I would hold you if I was in reach but for now here is a cute picture for you to look at to make you feel better!"
      },
      {
        "message": "it gets",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/youandme.jpg?raw=true",
        "desc": "During the moments, I cried you always held my hand or just hold me. I always felt very comforted and I wish I can do the same for you right now, but its kind of hard HOWEVER there is always Pumpkin or Octo that will be there with you. Also, I am just a call alway unless you happen to be near me somehow. Here is an image that made me happy every time I am looking at it. I think it would make you smile just a bit too. Stay hydrated and I love you and things will be okay."
      },
      {
        "message": "better~",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/doggie.png?raw=true",
        "desc": "Here is a cute pic of this corgi telling you to cheer up! SO LISTEN TO IT!"
      }
    ]
  },
  {
    "subject": "Missing Someone",
    "messageSelect": [
      {
        "message": "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/IMG_7251.jpg?raw=true",
        "desc": "hi, I see you are missing someone for you to already be reading this message. I wonder who it could be? But whoever you are missing I'm sure they are missing you too! So don't be afraid and call them if you can or better yet come to them in person and hug them tight! Here is a picture that would make you feel a bit better or at least laugh a little about it (since you see it so often)"
      },
      {
        "message": "o(〃＾▽＾〃)o",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/pink.jpg?raw=true",
        "desc": "hello hello again! it seems like you miss someone again for you to click on this emoji! Haha wink wink (get it cause the picture) okay that is enough. Maybe my corny jokes make you feel better but don't worry I am sure I am hvae a weird story/question to share with you today! Cheer up now!'"
      },
      {
        "message": "( ´･･)ﾉ(._.`)",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/corgi.png?raw=true",
        "desc": "HEY YOU YEAH YOU! My number is 405-413-#### maybe you should slide into my DMS and find out the last four hehe (let's continue our chaos now hehe)"
      }
    ]
  },
  {
    "subject": "Thoughts for you",
    "messageSelect": [
      {
        "message": "intro",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/Screenshot%202021-12-23%20220759.png?raw=true",
        "desc": "hi sir, if you just open the WPF file then you may have notice this new page. This page is dedciated to things I wanted to say to you (either there wasn't a right moment or just random thoughts I wanted to share) i thought about adding this after our small serious conversation not too long ago.I felt like I wanted to write a few things to show how much I appreciate you and when there is a time when things get rough I hope you go back to this page and remember the things I appreciate you for "
      },
      {
        "message": "<3",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/Screenshot%202021-12-23%20220720.png?raw=true",
        "desc": "hi hi, my thoughts is that I really appreciate the time you take to listen to my problems and are willing to correct your mistakes. I still have a bit of trauma from my last expereince where I was put at fault when the other person was not willing to grow with me and learn from their mistakes. I love how you are willing to grow with me. We are human so for the moment sometimes we get mad or frustrated, but I am just glad we are willing to talk out how we feel and work it out together. This makes me looking forward to the time we make it offical because I know whatever comes in our way I at least know you are willing to sit down and discuss it with me. "
      },
      {
        "message": "（づ￣3￣）づ╭❤️～",
        "img": "https://github.com/jenha88/GiftForYou/blob/main/Surprise/Surprise/Screenshot%202021-12-23%20220630.png?raw=true",
        "desc": "This is writen on 12/23/2021.It seems like during this time its your second day of work and you express me how much you hate it. There isn't much I can do but comofrt but I hope by the time you read this you enjoy the times we had together throughout the break and even before. I hope the future treats us right and that everything will be okay. I can't wait to be able to hug you again T^T I really do miss it hence my sort of clinginess lately. I hope you aren't too frustrated I'm sure there is a company out there that is perfect for you! Who knows maybe it will be the company we both work under. I hope you take care of yourself as you're reading this. Of course, you know that I am available whenever you need me. I love you and I am always rooting for you! You can do it! "
      }
    ]
  }

]